#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
aws_eip.eip_02: Refreshing state... [id=eipalloc-0bb2b1bfa4fa02029]
aws_iam_policy.AWSLoadBalancerControllerIAMPolicy: Refreshing state... [id=arn:aws:iam::318374019075:policy/earth-dev-AWSLoadBalancerControllerIAMPolicy]
aws_iam_role.AmazonEKSNodeGroupRole: Refreshing state... [id=earth-dev-AmazonEKSNodeGroupRole]
data.aws_iam_policy_document.AmazonEKSClusterAssumeRolePolicy: Reading...
aws_eip.eip_01: Refreshing state... [id=eipalloc-050c854445f64d567]
aws_iam_policy.AmazonEKSS3CSIDriverPolicy: Refreshing state... [id=arn:aws:iam::318374019075:policy/earth-dev-AmazonEKSS3CSIDriverPolicy]
aws_vpc.vpc: Refreshing state... [id=vpc-0478642ecab410b53]
data.aws_iam_policy_document.AmazonEKSClusterAssumeRolePolicy: Read complete after 0s [id=3552664922]
aws_iam_role.AmazonEKSClusterRole: Refreshing state... [id=earth-dev-AmazonEKSClusterRole]
aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Refreshing state... [id=earth-dev-AmazonEKSClusterRole-20231213101440949100000003]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=earth-dev-AmazonEKSClusterRole-20231213101440953400000004]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=earth-dev-AmazonEKSNodeGroupRole-20231213101440933400000001]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=earth-dev-AmazonEKSNodeGroupRole-20231213101440934500000002]
aws_security_group.allnodes-sg: Refreshing state... [id=sg-0ad96f4fcebf8aa1c]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-08ac575641a0f325b]
aws_subnet.private_subnet_01: Refreshing state... [id=subnet-037d0c83cac64eeef]
aws_subnet.public_subnet_01: Refreshing state... [id=subnet-0f5ddbb7c1d139256]
aws_security_group.cluster_sg: Refreshing state... [id=sg-06568abdd13b6e8f6]
aws_subnet.private_subnet_02: Refreshing state... [id=subnet-0a1e55c53ca1cab17]
aws_subnet.public_subnet_02: Refreshing state... [id=subnet-03f5e017f9be874cd]
aws_route_table.public_route_table: Refreshing state... [id=rtb-056925f144fe894e8]
aws_nat_gateway.nat_gateway_01: Refreshing state... [id=nat-08e104b55b3a9a8ec]
aws_nat_gateway.nat_gateway_02: Refreshing state... [id=nat-0d384a4009f6d57fd]
aws_route_table_association.route_table_association_p02: Refreshing state... [id=rtbassoc-0620b5f29ec5f8fad]
aws_route_table_association.route_table_association_p01: Refreshing state... [id=rtbassoc-0d2308dd2f7ec53d3]
aws_eks_cluster.eks_cluster: Refreshing state... [id=earth-dev]
aws_route_table.private_route_table_01: Refreshing state... [id=rtb-005225fbb32ba9992]
aws_route_table.private_route_table_02: Refreshing state... [id=rtb-0ee5eb194d018e592]
aws_route_table_association.route_table_association_i01: Refreshing state... [id=rtbassoc-05a1e5581da03e2bb]
aws_route_table_association.route_table_association_i02: Refreshing state... [id=rtbassoc-0166dbf55fd72bd53]
aws_eks_identity_provider_config.oidc: Refreshing state... [id=earth-dev:earth-dev]
data.tls_certificate.eks_cluster: Reading...
aws_eks_addon.kube_proxy: Refreshing state... [id=earth-dev:kube-proxy]
aws_launch_template.app_node: Refreshing state... [id=lt-033452e78e6697af1]
aws_eks_node_group.app_node_group: Refreshing state... [id=earth-dev:app-node-group]
data.tls_certificate.eks_cluster: Read complete after 1s [id=d516f34410b983ad338645e4e1cb5bbfcdf5079b]
aws_iam_openid_connect_provider.eks_cluster: Refreshing state... [id=arn:aws:iam::318374019075:oidc-provider/oidc.eks.ap-northeast-2.amazonaws.com/id/F51D73CC7993D3FD0CA52FA7C993D901]
data.aws_iam_policy_document.AmazonEKSEBSCSIDriverAssumeRolePolicy: Reading...
aws_eks_addon.vpc_cni: Refreshing state... [id=earth-dev:vpc-cni]
data.aws_iam_policy_document.AmazonEKSLoadBalancerControllerAssumeRolePolicy: Reading...
data.aws_iam_policy_document.AmazonEKSEBSCSIDriverAssumeRolePolicy: Read complete after 0s [id=3808211673]
data.aws_iam_policy_document.AmazonEKSVPCCNIAssumeRolePolicy: Reading...
data.aws_iam_policy_document.AmazonEKSS3CSIDriverAssumeRolePolicy: Reading...
data.aws_iam_policy_document.AmazonEKSLoadBalancerControllerAssumeRolePolicy: Read complete after 0s [id=974913541]
aws_iam_role.AmazonEKSEBSCSIDriverRole: Refreshing state... [id=earth-dev-AmazonEKSEBSCSIDriverRole]
data.aws_iam_policy_document.AmazonEKSVPCCNIAssumeRolePolicy: Read complete after 0s [id=695197460]
data.aws_iam_policy_document.AmazonEKSS3CSIDriverAssumeRolePolicy: Read complete after 0s [id=1219021894]
aws_iam_role.AmazonEKSVPCCNIRole: Refreshing state... [id=earth-dev-AmazonEKSVPCCNIRole]
aws_iam_role.AmazonEKSLoadBalancerControllerRole: Refreshing state... [id=earth-dev-AmazonEKSLoadBalancerControllerRole]
aws_iam_role.AmazonEKSS3CSIDriverRole: Refreshing state... [id=earth-dev-AmazonEKSS3CSIDriverRole]
aws_eks_addon.coredns: Refreshing state... [id=earth-dev:coredns]
aws_eks_addon.aws-mountpoint-s3-csi-driver: Refreshing state... [id=earth-dev:aws-mountpoint-s3-csi-driver]
aws_eks_addon.aws_ebs_csi_driver: Refreshing state... [id=earth-dev:aws-ebs-csi-driver]
aws_iam_role_policy_attachment.AmazonEKSS3CSIDriverPolicy: Refreshing state... [id=earth-dev-AmazonEKSS3CSIDriverRole-20231213102116771100000010]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=earth-dev-AmazonEKSVPCCNIRole-2023121310211669920000000d]
aws_iam_role_policy_attachment.AmazonEBSCSIDriverPolicy: Refreshing state... [id=earth-dev-AmazonEKSEBSCSIDriverRole-2023121310211673070000000f]
aws_iam_role_policy_attachment.AWSLoadBalancerControllerIAMPolicy: Refreshing state... [id=earth-dev-AmazonEKSLoadBalancerControllerRole-2023121310211672590000000e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_addon.aws-mountpoint-s3-csi-driver is tainted, so must be replaced
-/+ resource "aws_eks_addon" "aws-mountpoint-s3-csi-driver" {
      ~ arn                         = "arn:aws:eks:ap-northeast-2:318374019075:addon/earth-dev/aws-mountpoint-s3-csi-driver/5ac6315a-13b1-74f7-132d-31b33d085742" -> (known after apply)
      + configuration_values        = (known after apply)
      ~ created_at                  = "2023-12-13T10:23:43Z" -> (known after apply)
      ~ id                          = "earth-dev:aws-mountpoint-s3-csi-driver" -> (known after apply)
      ~ modified_at                 = "2023-12-13T10:23:43Z" -> (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "PRESERVE"
      - tags                        = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_eks_addon.aws_ebs_csi_driver is tainted, so must be replaced
-/+ resource "aws_eks_addon" "aws_ebs_csi_driver" {
      ~ arn                         = "arn:aws:eks:ap-northeast-2:318374019075:addon/earth-dev/aws-ebs-csi-driver/42c6315a-13b4-5bd7-57ba-f26ced2c99bf" -> (known after apply)
      + configuration_values        = (known after apply)
      ~ created_at                  = "2023-12-13T10:23:43Z" -> (known after apply)
      ~ id                          = "earth-dev:aws-ebs-csi-driver" -> (known after apply)
      ~ modified_at                 = "2023-12-13T10:23:43Z" -> (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "PRESERVE"
      - tags                        = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_eks_addon.coredns is tainted, so must be replaced
-/+ resource "aws_eks_addon" "coredns" {
      ~ arn                         = "arn:aws:eks:ap-northeast-2:318374019075:addon/earth-dev/coredns/dac6315a-13b4-15d0-64df-f7ede9d35263" -> (known after apply)
      + configuration_values        = (known after apply)
      ~ created_at                  = "2023-12-13T10:23:43Z" -> (known after apply)
      ~ id                          = "earth-dev:coredns" -> (known after apply)
      ~ modified_at                 = "2023-12-13T10:23:43Z" -> (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "PRESERVE"
      - tags                        = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_eks_addon.kube_proxy is tainted, so must be replaced
-/+ resource "aws_eks_addon" "kube_proxy" {
      ~ addon_version               = "v1.27.6-eksbuild.2" -> "v1.27.1-eksbuild.1"
      ~ arn                         = "arn:aws:eks:ap-northeast-2:318374019075:addon/earth-dev/kube-proxy/f8c63158-f44a-2ace-0859-db815714418c" -> (known after apply)
      + configuration_values        = (known after apply)
      ~ created_at                  = "2023-12-13T10:21:16Z" -> (known after apply)
      ~ id                          = "earth-dev:kube-proxy" -> (known after apply)
      ~ modified_at                 = "2023-12-13T10:21:18Z" -> (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "PRESERVE"
      - tags                        = {} -> null
        # (3 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jonghak-dev, Action: `pull_request`, Workflow: `Terraform apply`*